zpq001/mdr32f9q-ps200w/branches/FreeRTOS-port/src/systemfunc.c
	// Initialize timer 3 channel 1
	TIMER_ChnStructInit(&sTIM_ChnInit);
	sTIM_ChnInit.TIMER_CH_Number              = TIMER_CHANNEL1;
	sTIM_ChnInit.TIMER_CH_Mode                = TIMER_CH_MODE_PWM;
	sTIM_ChnInit.TIMER_CH_REF_Format          = TIMER_CH_REF_Format6;
	sTIM_ChnInit.TIMER_CH_CCR_UpdateMode      = TIMER_CH_CCR_Update_On_CNT_eq_0;
	TIMER_ChnInit(MDR_TIMER3, &sTIM_ChnInit);

	// Initialize timer 3 channel 1 output
	TIMER_ChnOutStructInit(&sTIM_ChnOutInit);
	sTIM_ChnOutInit.TIMER_CH_Number                   = TIMER_CHANNEL1;
	sTIM_ChnOutInit.TIMER_CH_DirOut_Source            = TIMER_CH_OutSrc_REF;
	sTIM_ChnOutInit.TIMER_CH_DirOut_Polarity          = TIMER_CHOPolarity_NonInverted;
	sTIM_ChnOutInit.TIMER_CH_DirOut_Mode              = TIMER_CH_OutMode_Output;
	TIMER_ChnOutInit(MDR_TIMER3, &sTIM_ChnOutInit);

	// Initialize timer 3 channel 3
	sTIM_ChnInit.TIMER_CH_Number              = TIMER_CHANNEL3;
	TIMER_ChnInit(MDR_TIMER3, &sTIM_ChnInit);
	
	// Initialize timer 3 channel 3 output
	sTIM_ChnOutInit.TIMER_CH_Number           	= TIMER_CHANNEL3;
	sTIM_ChnOutInit.TIMER_CH_DirOut_Source      = TIMER_CH_OutSrc_Only_0;
	sTIM_ChnOutInit.TIMER_CH_DirOut_Mode        = TIMER_CH_OutMode_Input;
	sTIM_ChnOutInit.TIMER_CH_NegOut_Source     	= TIMER_CH_OutSrc_REF;
	sTIM_ChnOutInit.TIMER_CH_NegOut_Polarity   	= TIMER_CHOPolarity_Inverted;
	sTIM_ChnOutInit.TIMER_CH_NegOut_Mode       	= TIMER_CH_OutMode_Output;
	TIMER_ChnOutInit(MDR_TIMER3, &sTIM_ChnOutInit);


	// Set default PWM duty cycle for LCD backlight PWM	
	MDR_TIMER3->CCR1 = 0;
	
	// Set default PWM duty cycle for system cooler PWM
	MDR_TIMER3->CCR3 = 0;

	// Enable TIMER3 counter clock
	TIMER_BRGInit(MDR_TIMER3,TIMER_HCLKdiv1);

	// Enable TIMER3
	TIMER_Cmd(MDR_TIMER3,ENABLE);
	


}






void SetVoltagePWMPeriod(uint16_t new_period)
{
	MDR_TIMER2->CCR1 = new_period;	
}

void SetCurrentPWMPeriod(uint16_t new_period)
{
	MDR_TIMER2->CCR3 = new_period;	
}






void SetCoolerSpeed(uint16_t speed)
{
	MDR_TIMER3->CCR3 = speed;
}





//==============================================================//
// Set LCD backlight intense
// 0 to 100
//==============================================================//
void LcdSetBacklight(uint16_t value)
{
	if (value>100) value = 100;
		MDR_TIMER3->CCR1 = value;
}



void ProcessPowerOff(void)
{
	uint32_t time_delay;
	if (GetACLineStatus() == OFFLINE)
	{	
		__disable_irq();

		SetConverterState(CONVERTER_OFF);		// safe because we're stopping in this function

		//SysTickStop();
		//StopBeep();

		time_delay = DWT_StartDelayUs(5000);

		LcdSetBacklight(0);
		SetCoolerSpeed(0);
		SetVoltagePWMPeriod(0);
		SetCurrentPWMPeriod(0);


		// Put message
		LcdFillBuffer(lcd0_buffer,0);
		LcdFillBuffer(lcd1_buffer,0);
		LcdPutNormalStr(0,10,"Power OFF",(tNormalFont*)&font_8x12,lcd0_buffer);
		LcdPutNormalStr(0,10,"Power OFF",(tNormalFont*)&font_8x12,lcd1_buffer);



		while(DWT_DelayInProgress(time_delay));

		SetFeedbackChannel(CHANNEL_12V);
		SetCurrentLimit(CURRENT_LIM_HIGH); 
		SetOutputLoad(LOAD_DISABLE); 

		LcdUpdateByCore(LCD0,lcd0_buffer);
		LcdUpdateByCore(LCD1,lcd1_buffer);



		time_delay = DWT_StartDelayUs(1000);
		while(DWT_DelayInProgress(time_delay));

		PORT_DeInit(MDR_PORTA);
		PORT_DeInit(MDR_PORTB);
		PORT_DeInit(MDR_PORTC);
		PORT_DeInit(MDR_PORTD);
		PORT_DeInit(MDR_PORTE);
		PORT_DeInit(MDR_PORTF);

		while(1);
		 
	}
}


struct {
	uint32_t stacked_r0;
	uint32_t stacked_r1;
	uint32_t stacked_r2;
	uint32_t stacked_r3;
	uint32_t stacked_r12;
	uint32_t stacked_lr;
	uint32_t stacked_pc;
	uint32_t stacked_psr;
	uint32_t BFAR;
	uint32_t CFSR;
	uint32_t HFSR;
	uint32_t DFSR;
	uint32_t AFSR;
	uint32_t SBC_SHCSR;
} dbg_struct;


// Hard fault handler
// with stack frame location as input parameter
// called from HardFault_Handler in file startup_MDR32F9x.s
void hard_fault_handler_c (unsigned int * hardfault_args)
{

  dbg_struct.stacked_r0 = ((unsigned long) hardfault_args[0]);
  dbg_struct.stacked_r1 = ((unsigned long) hardfault_args[1]);
  dbg_struct.stacked_r2 = ((unsigned long) hardfault_args[2]);
  dbg_struct.stacked_r3 = ((unsigned long) hardfault_args[3]);
 
  dbg_struct.stacked_r12 = ((unsigned long) hardfault_args[4]);
  dbg_struct.stacked_lr = ((unsigned long) hardfault_args[5]);
  dbg_struct.stacked_pc = ((unsigned long) hardfault_args[6]);
  dbg_struct.stacked_psr = ((unsigned long) hardfault_args[7]);
 /*
  printf ("\n\n[Hard fault handler - all numbers in hex]\n");
  printf ("R0 = %x\n", stacked_r0);
  printf ("R1 = %x\n", stacked_r1);
  printf ("R2 = %x\n", stacked_r2);
  printf ("R3 = %x\n", stacked_r3);
  printf ("R12 = %x\n", stacked_r12);
  printf ("LR [R14] = %x  subroutine call return address\n", stacked_lr);
  printf ("PC [R15] = %x  program counter\n", stacked_pc);
  printf ("PSR = %x\n", stacked_psr);
  printf ("BFAR = %x\n", (*((volatile unsigned long *)(0xE000ED38))));
  printf ("CFSR = %x\n", (*((volatile unsigned long *)(0xE000ED28))));
  printf ("HFSR = %x\n", (*((volatile unsigned long *)(0xE000ED2C))));
  printf ("DFSR = %x\n", (*((volatile unsigned long *)(0xE000ED30))));
  printf ("AFSR = %x\n", (*((volatile unsigned long *)(0xE000ED3C))));
  printf ("SCB_SHCSR = %x\n", SCB->SHCSR);
 */
  while (1);
}



